import { describe, expect, test } from '@jest/globals';
import { WechatRawTxn } from './model';
import { parseOneLineWechatTxn, parseWechatRawTxn } from './parse';
describe('parse wechat txn', () => {
    describe('parse one line txn', () => {
        test('parse one line', () => {
            const line = '2022-11-27 18:52:06,商户消费,美团平台商户,"美团订单-22112711100400000028552773969159",支出,¥52.00,招商银行(7663),支付成功,4200001679202211272641717116	,22112711100400000028552773969159	,"/"'
            const result = parseOneLineWechatTxn(line)

            expect(result).toEqual({
                txnTime: "2022-11-27 18:52:06",
                txnType: "商户消费",
                counterparty: "美团平台商户",
                product: "美团订单-22112711100400000028552773969159",
                inOut: "支出",
                amount: "¥52.00",
                paymentMethod: "招商银行(7663)",
                status: "支付成功",
                merchantId: "22112711100400000028552773969159",
                remark: "/",
                txnId: "4200001679202211272641717116",
                raw: line
            } as WechatRawTxn)

        })
    })
    describe('parse multiple lines txn', () => {
        test('parse multiple lines', () => {
            const lines = `微信支付账单明细,,,,,,,,
微信昵称：[STRRL],,,,,,,,
起始时间：[2022-09-01 00:00:00] 终止时间：[2022-12-01 23:59:59],,,,,,,,
导出类型：[全部],,,,,,,,
导出时间：[2023-03-24 15:17:59],,,,,,,,
,,,,,,,,
共74笔记录,,,,,,,,
收入：11笔 58190.50元,,,,,,,,
支出：62笔 30766.39元,,,,,,,,
中性交易：1笔 30152.45元,,,,,,,,
注：,,,,,,,,
1. 充值/提现/理财通购买/零钱通存取/信用卡还款等交易，将计入中性交易,,,,,,,,
2. 本明细仅展示当前账单中的交易，不包括已删除的记录,,,,,,,,
3. 本明细仅供个人对账使用,,,,,,,,
,,,,,,,,
----------------------微信支付账单明细列表--------------------,,,,,,,,
交易时间,交易类型,交易对方,商品,收/支,金额(元),支付方式,当前状态,交易单号,商户单号,备注
2022-11-27 18:52:06,商户消费,美团平台商户,"美团订单-22112711100400000028552773969159",支出,¥52.00,招商银行(7663),支付成功,4200001679202211272641717116	,22112711100400000028552773969159	,"/"
2022-11-13 19:46:00,扫二维码付款,刘记私房菜,"收款方备注:二维码收款",支出,¥155.00,零钱,已转账,100004990122111300060322787419276542	,10000499012022111300846704940131	,"/"
2022-10-14 15:52:59,微信红包,菩提,"/",收入,¥200.00,/,已存入零钱,1000039801000210146064979509049	,1000039801202210146064979509049	,"/"
`
            const result = parseWechatRawTxn(lines)
            expect(result).toEqual([
                {
                    txnTime: "2022-11-27 18:52:06",
                    txnType: "商户消费",
                    counterparty: "美团平台商户",
                    product: "美团订单-22112711100400000028552773969159",
                    inOut: "支出",
                    amount: "¥52.00",
                    paymentMethod: "招商银行(7663)",
                    status: "支付成功",
                    merchantId: "22112711100400000028552773969159",
                    remark: "/",
                    txnId: "4200001679202211272641717116",
                    raw: '2022-11-27 18:52:06,商户消费,美团平台商户,"美团订单-22112711100400000028552773969159",支出,¥52.00,招商银行(7663),支付成功,4200001679202211272641717116	,22112711100400000028552773969159	,"/"'
                }, {
                    txnTime: "2022-11-13 19:46:00",
                    txnType: "扫二维码付款",
                    counterparty: "刘记私房菜",
                    product: "收款方备注:二维码收款",
                    inOut: "支出",
                    amount: "¥155.00",
                    paymentMethod: "零钱",
                    status: "已转账",
                    merchantId: "10000499012022111300846704940131",
                    remark: "/",
                    txnId: "100004990122111300060322787419276542",
                    raw: '2022-11-13 19:46:00,扫二维码付款,刘记私房菜,"收款方备注:二维码收款",支出,¥155.00,零钱,已转账,100004990122111300060322787419276542	,10000499012022111300846704940131	,"/"'
                }, {
                    txnTime: "2022-10-14 15:52:59",
                    txnType: "微信红包",
                    counterparty: "菩提",
                    product: "/",
                    inOut: "收入",
                    amount: "¥200.00",
                    paymentMethod: "/",
                    status: "已存入零钱",
                    merchantId: "1000039801202210146064979509049",
                    remark: "/",
                    txnId: "1000039801000210146064979509049",
                    raw: '2022-10-14 15:52:59,微信红包,菩提,"/",收入,¥200.00,/,已存入零钱,1000039801000210146064979509049	,1000039801202210146064979509049	,"/"'
                }
            ] as WechatRawTxn[])
        })
    })
})
